{
  "irVersion": "1.0",
  "project": "schemakit",
  "repository": "https://github.com/grokify/schemakit",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify"],
  "releases": [
    {
      "version": "v0.4.0",
      "date": "2026-04-18",
      "highlights": [
        {"description": "Rename to schemakit and add doc command for Markdown documentation generation"}
      ],
      "breaking": [
        {"description": "Rename binary from `schemalint` to `schemakit`", "commit": "299d3d9"},
        {"description": "Rename module from `github.com/grokify/schemalint` to `github.com/grokify/schemakit`", "commit": "299d3d9"}
      ],
      "added": [
        {"description": "`schemakit doc` command to generate Markdown documentation from Go struct types", "commit": "2803436"},
        {"description": "Extract package doc comments, type descriptions, and field comments via reflection", "commit": "2803436"},
        {"description": "Generate required/optional field tables with JSON names and types", "commit": "2803436"},
        {"description": "Support `--title` and `--version` flags for documentation headers", "commit": "2803436"}
      ],
      "documentation": [
        {"description": "Update README with schemakit branding and doc command usage", "commit": "c38b257"},
        {"description": "Add Go-first workflow diagram showing generate and doc commands", "commit": "c38b257"},
        {"description": "Release notes for v0.4.0", "commit": ""}
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-02-09",
      "highlights": [
        {"description": "Generate JSON Schema from Go struct types using invopop/jsonschema"}
      ],
      "added": [
        {"description": "`schemalint generate` command to generate JSON Schema from Go struct types", "commit": "1148f63"},
        {"description": "Support for both local (GOPATH/src) and remote Go modules in schema generation", "commit": "1148f63"},
        {"description": "GitHub Actions release workflow for GoReleaser", "commit": "44a4252"}
      ],
      "changed": [
        {"description": "Rename ROADMAP.json/md to TASKS.json/md", "commit": "1148f63"}
      ],
      "fixed": [
        {"description": "Fix .gitignore pattern to not exclude cmd/schemalint/ files", "commit": "1148f63"}
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-02-08",
      "highlights": [
        {"description": "Rename to schemalint and add scale profile for strict static type compatibility"}
      ],
      "breaking": [
        {"description": "Rename binary from `schemago` to `schemalint`", "commit": "a96efd5"},
        {"description": "Rename module from `github.com/grokify/schemago` to `github.com/grokify/schemalint`", "commit": "a96efd5"}
      ],
      "added": [
        {"description": "`--profile` / `-p` flag to select linting profile (`default`, `scale`)", "commit": "c0fed40"},
        {"description": "Scale profile with `composition-disallowed` rule: disallow `anyOf`, `oneOf`, `allOf`", "commit": "c0fed40"},
        {"description": "Scale profile with `additional-properties-disallowed` rule: disallow `additionalProperties: true`", "commit": "c0fed40"},
        {"description": "Scale profile with `missing-type` rule: require explicit `type` field", "commit": "c0fed40"},
        {"description": "Scale profile with `mixed-type-disallowed` rule: disallow type arrays like `[\"string\", \"number\"]`", "commit": "c0fed40"},
        {"description": "Goreleaser configuration for cross-platform builds and Homebrew tap", "commit": "b5d1fab"},
        {"description": "`--property-case` flag to enforce property naming conventions (e.g., camelCase, snake_case)", "commit": "73ed44f"}
      ],
      "changed": [
        {"description": "Update CLI description to emphasize static type compatibility for all languages (Go, Rust, TypeScript, etc.)", "commit": "a96efd5"}
      ],
      "documentation": [
        {"description": "README with scale profile docs and Homebrew installation", "commit": "3d4a088"},
        {"description": "Release notes for v0.2.0", "commit": "3d4a088"},
        {"description": "PRD, TRD, and ROADMAP updated for schemalint", "commit": "f7e418d"}
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-17",
      "highlights": [
        {"description": "Initial release with JSON Schema linter for Go compatibility"}
      ],
      "added": [
        {"description": "CLI with `lint` and `version` commands using cobra", "commit": "f8ed488"},
        {"description": "JSON Schema parser for linting (supports `$defs`, `definitions`, `anyOf`, `oneOf`)", "commit": "f8ed488"},
        {"description": "Union detection with discriminator field analysis", "commit": "f8ed488"},
        {"description": "Nullable pattern detection (`anyOf: [T, null]`)", "commit": "f8ed488"},
        {"description": "Reference pattern detection (`anyOf: [ComponentReference, BaseXxx]`)", "commit": "f8ed488"},
        {"description": "Configurable discriminator field priority (`component_type`, `type`, `kind`)", "commit": "f8ed488"},
        {"description": "Multiple output formats: text (default), JSON, GitHub Actions annotations", "commit": "f8ed488"},
        {"description": "Exit codes: 0 (ok), 1 (errors), 2 (warnings only)", "commit": "f8ed488"}
      ],
      "documentation": [
        {"description": "Product Requirements Document (PRD.md)", "commit": "b0e491a"},
        {"description": "Technical Requirements Document (TRD.md)", "commit": "b0e491a"},
        {"description": "README with installation and usage instructions", "commit": "b0e491a"}
      ]
    }
  ]
}
