{
  "ir_version": "1.0",
  "project": "schemago",
  "repository": "https://github.com/grokify/schemago",
  "releases": [
    {
      "version": "0.1.0",
      "date": "2026-01-17",
      "description": "Initial release with JSON Schema linter for Go compatibility",
      "added": [
        {"description": "CLI with `lint` and `version` commands using cobra", "commit": "f8ed488"},
        {"description": "JSON Schema parser for linting (supports `$defs`, `definitions`, `anyOf`, `oneOf`)", "commit": "f8ed488"},
        {"description": "Union detection with discriminator field analysis", "commit": "f8ed488"},
        {"description": "Nullable pattern detection (`anyOf: [T, null]`)", "commit": "f8ed488"},
        {"description": "Reference pattern detection (`anyOf: [ComponentReference, BaseXxx]`)", "commit": "f8ed488"},
        {"description": "Configurable discriminator field priority (`component_type`, `type`, `kind`)", "commit": "f8ed488"},
        {"description": "Multiple output formats: text (default), JSON, GitHub Actions annotations", "commit": "f8ed488"},
        {"description": "Exit codes: 0 (ok), 1 (errors), 2 (warnings only)", "commit": "f8ed488"}
      ],
      "documentation": [
        {"description": "Product Requirements Document (PRD.md)", "commit": "b0e491a"},
        {"description": "Technical Requirements Document (TRD.md)", "commit": "b0e491a"},
        {"description": "README with installation and usage instructions", "commit": "b0e491a"}
      ]
    }
  ]
}
