{
  "ir_version": "1.0",
  "project": "schemalint",
  "repository": "https://github.com/grokify/schemalint",
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-02-08",
      "description": "Rename to schemalint and add scale profile for strict static type compatibility",
      "changed": [
        {"description": "**BREAKING**: Rename binary from `schemago` to `schemalint`", "commit": "a96efd5"},
        {"description": "**BREAKING**: Rename module from `github.com/grokify/schemago` to `github.com/grokify/schemalint`", "commit": "a96efd5"},
        {"description": "Update CLI description to emphasize static type compatibility for all languages (Go, Rust, TypeScript, etc.)", "commit": "a96efd5"}
      ],
      "added": [
        {"description": "`--profile` / `-p` flag to select linting profile (`default`, `scale`)", "commit": "c0fed40"},
        {"description": "Scale profile with `composition-disallowed` rule: disallow `anyOf`, `oneOf`, `allOf`", "commit": "c0fed40"},
        {"description": "Scale profile with `additional-properties-disallowed` rule: disallow `additionalProperties: true`", "commit": "c0fed40"},
        {"description": "Scale profile with `missing-type` rule: require explicit `type` field", "commit": "c0fed40"},
        {"description": "Scale profile with `mixed-type-disallowed` rule: disallow type arrays like `[\"string\", \"number\"]`", "commit": "c0fed40"},
        {"description": "Goreleaser configuration for cross-platform builds and Homebrew tap", "commit": "b5d1fab"}
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-17",
      "description": "Initial release with JSON Schema linter for Go compatibility",
      "added": [
        {"description": "CLI with `lint` and `version` commands using cobra", "commit": "f8ed488"},
        {"description": "JSON Schema parser for linting (supports `$defs`, `definitions`, `anyOf`, `oneOf`)", "commit": "f8ed488"},
        {"description": "Union detection with discriminator field analysis", "commit": "f8ed488"},
        {"description": "Nullable pattern detection (`anyOf: [T, null]`)", "commit": "f8ed488"},
        {"description": "Reference pattern detection (`anyOf: [ComponentReference, BaseXxx]`)", "commit": "f8ed488"},
        {"description": "Configurable discriminator field priority (`component_type`, `type`, `kind`)", "commit": "f8ed488"},
        {"description": "Multiple output formats: text (default), JSON, GitHub Actions annotations", "commit": "f8ed488"},
        {"description": "Exit codes: 0 (ok), 1 (errors), 2 (warnings only)", "commit": "f8ed488"}
      ],
      "documentation": [
        {"description": "Product Requirements Document (PRD.md)", "commit": "b0e491a"},
        {"description": "Technical Requirements Document (TRD.md)", "commit": "b0e491a"},
        {"description": "README with installation and usage instructions", "commit": "b0e491a"}
      ]
    }
  ]
}
