{
  "ir_version": "1.0",
  "project": "schemalint",
  "repository": "https://github.com/grokify/schemalint",

  "legend": {
    "completed": {"emoji": "✅", "description": "Completed"},
    "in_progress": {"emoji": "🚧", "description": "In Progress"},
    "planned": {"emoji": "📋", "description": "Planned"},
    "future": {"emoji": "💡", "description": "Under Consideration"}
  },

  "areas": [
    {"id": "linter", "name": "Linter", "priority": 1},
    {"id": "cli", "name": "CLI", "priority": 2},
    {"id": "testing", "name": "Testing", "priority": 3},
    {"id": "distribution", "name": "Distribution", "priority": 4}
  ],

  "phases": [
    {
      "id": "v0.1",
      "name": "v0.1.0 - Foundation",
      "status": "completed",
      "order": 1,
      "description": "Project structure, linter with union detection"
    },
    {
      "id": "v0.2",
      "name": "v0.2.0 - Scale Profile",
      "status": "completed",
      "order": 2,
      "description": "Strict scale profile, Homebrew support, rename to schemalint"
    },
    {
      "id": "v0.3",
      "name": "v0.3.0 - Configuration",
      "status": "planned",
      "order": 3,
      "description": "Configuration file support, additional lint checks"
    },
    {
      "id": "v1.0",
      "name": "v1.0.0 - Production Ready",
      "status": "planned",
      "order": 4,
      "description": "Stable API, comprehensive documentation"
    },
    {
      "id": "future",
      "name": "Future",
      "status": "future",
      "order": 99,
      "description": "Ideas under consideration"
    }
  ],

  "items": [
    {
      "id": "project-structure",
      "title": "Project structure and CI setup",
      "description": "Initialize Go module, directory structure, GitHub Actions CI",
      "status": "completed",
      "target_version": "0.1.0",
      "phase": "v0.1",
      "area": "distribution",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "cli-lint",
      "title": "`schemalint lint` command",
      "description": "Lint JSON Schema for static type compatibility issues",
      "status": "completed",
      "target_version": "0.1.0",
      "phase": "v0.1",
      "area": "cli",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "lint-union-no-discriminator",
      "title": "Check: union without discriminator",
      "description": "Error when anyOf/oneOf has no const discriminator field",
      "status": "completed",
      "target_version": "0.1.0",
      "phase": "v0.1",
      "area": "linter",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "lint-inconsistent-discriminator",
      "title": "Check: inconsistent discriminator",
      "description": "Error when variants use different discriminator field names",
      "status": "completed",
      "target_version": "0.1.0",
      "phase": "v0.1",
      "area": "linter",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "lint-missing-const",
      "title": "Check: missing const in variant",
      "description": "Error when union variant lacks const value for discriminator",
      "status": "completed",
      "target_version": "0.1.0",
      "phase": "v0.1",
      "area": "linter",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "lint-large-union",
      "title": "Check: large union warning",
      "description": "Warning when union has more than 10 variants",
      "status": "completed",
      "target_version": "0.1.0",
      "phase": "v0.1",
      "area": "linter",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "lint-nested-union",
      "title": "Check: deeply nested unions",
      "description": "Warning when unions are nested more than 2 levels deep",
      "status": "completed",
      "target_version": "0.1.0",
      "phase": "v0.1",
      "area": "linter",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "lint-additional-props",
      "title": "Check: additionalProperties on union",
      "description": "Warning when additionalProperties: true may cause ambiguous decoding",
      "status": "completed",
      "target_version": "0.1.0",
      "phase": "v0.1",
      "area": "linter",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "lint-output-formats",
      "title": "Multiple output formats for lint",
      "description": "Support text, JSON, and GitHub Actions annotation format",
      "status": "completed",
      "target_version": "0.1.0",
      "phase": "v0.1",
      "area": "linter",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "profile-flag",
      "title": "`--profile` flag for profile selection",
      "description": "Select linting profile (default, scale) via CLI flag",
      "status": "completed",
      "target_version": "0.2.0",
      "phase": "v0.2",
      "area": "cli",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "scale-composition",
      "title": "Scale profile: disallow composition",
      "description": "Error when anyOf, oneOf, or allOf is used in scale profile",
      "status": "completed",
      "target_version": "0.2.0",
      "phase": "v0.2",
      "area": "linter",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "scale-additional-props",
      "title": "Scale profile: disallow additionalProperties",
      "description": "Error when additionalProperties: true in scale profile",
      "status": "completed",
      "target_version": "0.2.0",
      "phase": "v0.2",
      "area": "linter",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "scale-missing-type",
      "title": "Scale profile: require explicit type",
      "description": "Error when schema lacks explicit type field in scale profile",
      "status": "completed",
      "target_version": "0.2.0",
      "phase": "v0.2",
      "area": "linter",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "scale-mixed-type",
      "title": "Scale profile: disallow mixed types",
      "description": "Error when type is an array like [\"string\", \"number\"] in scale profile",
      "status": "completed",
      "target_version": "0.2.0",
      "phase": "v0.2",
      "area": "linter",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "goreleaser",
      "title": "GoReleaser configuration",
      "description": "Multi-platform binary releases",
      "status": "completed",
      "target_version": "0.2.0",
      "phase": "v0.2",
      "area": "distribution",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "homebrew",
      "title": "Homebrew tap",
      "description": "Install via brew install grokify/tap/schemalint",
      "status": "completed",
      "target_version": "0.2.0",
      "phase": "v0.2",
      "area": "distribution",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "config-file",
      "title": "Configuration file support",
      "description": "YAML config file for linting options",
      "status": "planned",
      "target_version": "0.3.0",
      "phase": "v0.3",
      "area": "cli",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "ref-resolution",
      "title": "$ref resolution",
      "description": "Resolve local $ref references for more accurate linting",
      "status": "planned",
      "target_version": "0.3.0",
      "phase": "v0.3",
      "area": "linter",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "additional-checks",
      "title": "Additional lint checks",
      "description": "More checks for common schema issues",
      "status": "planned",
      "target_version": "0.3.0",
      "phase": "v0.3",
      "area": "linter",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "docs",
      "title": "Comprehensive documentation",
      "description": "README, examples, API documentation",
      "status": "planned",
      "target_version": "1.0.0",
      "phase": "v1.0",
      "area": "distribution",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "go-generate",
      "title": "go:generate support",
      "description": "Support //go:generate schemalint directive",
      "status": "planned",
      "target_version": "1.0.0",
      "phase": "v1.0",
      "area": "cli",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "openapi-support",
      "title": "OpenAPI 3.1 support",
      "description": "Extract and lint JSON Schema from OpenAPI documents",
      "status": "future",
      "phase": "future",
      "area": "linter",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "language-profiles",
      "title": "Language-specific profiles",
      "description": "Profiles optimized for Go, Rust, TypeScript, etc.",
      "status": "future",
      "phase": "future",
      "area": "linter",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "github-action",
      "title": "GitHub Action (separate repo)",
      "description": "Reusable GitHub Action in grokify/schemalint-action for CI/CD integration. Uses floating major version tags (v1, v2) per GitHub Action conventions.",
      "status": "future",
      "phase": "future",
      "area": "distribution",
      "type": "Added",
      "priority": "high"
    }
  ],

  "sections": [
    {
      "id": "overview",
      "title": "Overview",
      "order": 1,
      "content": [
        {"type": "text", "value": "**schemalint** is a JSON Schema linter for static type compatibility. It validates JSON Schema files for patterns that cause problems when generating code for statically-typed languages like Go, Rust, and TypeScript."}
      ]
    },
    {
      "id": "motivation",
      "title": "Motivation",
      "order": 2,
      "content": [
        {"type": "text", "value": "JSON Schema supports dynamic patterns (union types, mixed types, open objects) that don't map cleanly to statically-typed languages. Code generators often produce `interface{}` or `any` types, losing type safety."},
        {"type": "text", "value": "schemalint catches these patterns early, before code generation, ensuring schemas are compatible with static type systems."}
      ]
    },
    {
      "id": "references",
      "title": "References",
      "order": 99,
      "content": [
        {"type": "list", "items": [
          "[README.md](README.md) - Quick start guide",
          "[PRD.md](PRD.md) - Product requirements",
          "[TRD.md](TRD.md) - Technical requirements",
          "[JSON Schema Draft 2020-12](https://json-schema.org/draft/2020-12/json-schema-core)"
        ]}
      ]
    }
  ],

  "version_history": [
    {"version": "0.1.0", "date": "2026-01-17", "status": "completed", "summary": "Foundation - linter with union detection"},
    {"version": "0.2.0", "date": "2026-02-08", "status": "completed", "summary": "Scale profile, Homebrew support, rename to schemalint"},
    {"version": "0.3.0", "date": null, "status": "planned", "summary": "Configuration file, $ref resolution"},
    {"version": "1.0.0", "date": null, "status": "planned", "summary": "Production ready release"}
  ]
}
